EX12: PROC OPTIONS (MAIN);                                                     DCL A BIN FIXED INIT ( 3 );                                                  DCL B DEC FIXED INIT ( 3 );                                                  DCL C BIN FIXED;                                                               C = B * A;                                                                     C = A = C;                                                                   END EX12;      